Day 1

In [22]:
import pandas as pd

In [10]:
with open('input/day1.txt') as f:
    data = f.read().splitlines()

data[:5]

['62619   25903',
 '30326   94750',
 '84092   60901',
 '37915   71402',
 '15035   84878']

In [18]:
left = [int(line.split('   ')[0]) for line in data]
right = [int(line.split('   ')[1]) for line in data]

In [24]:
left_sorted = sorted(left)
right_sorted = sorted(right)

df = pd.DataFrame({'left': left_sorted, 'right': right_sorted})
df

      left  right
0    10150  10056
1    10176  10079
2    10188  10088
3    10372  10373
4    10461  10521
..     ...    ...
995  99672  99477
996  99712  99491
997  99785  99505
998  99804  99653
999  99960  99770

[1000 rows x 2 columns]

In [27]:
df['diff'] = (df['right'] - df['left']).abs()

In [29]:
sum(df['diff'])

1388114

In [36]:
df['count'] = df.apply(lambda x: right_sorted.count(x['left']), axis=1)

In [40]:
df['similar'] = df['left'] * df['count']

In [41]:
sum(df['similar'])

23529853